Revit 2026 API

# DisplacementElementSetRelativeDisplacement Method

---

Sets the relative displacement applied to the displaced elements by this DisplacementElement.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetRelativeDisplacement(
	XYZ displacement
)
```
```vb
Public Sub SetRelativeDisplacement (
	displacement As XYZ
)
```
```cpp
public:
void SetRelativeDisplacement(
	XYZ^ displacement
)
```
```fsharp
member SetRelativeDisplacement :
        displacement : XYZ -> unit
```

#### Parameters

displacement XYZ
     The relative displacement.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DisplacementElement Class

Autodesk.Revit.DB Namespace